Revit 2027 API
RebarConstrainedHandle.GetHandleType Method
 Returns the RebarHandleType of a RebarConstrainedHandle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarHandleType GetHandleType()
Public Function GetHandleType As RebarHandleType
public:
RebarHandleType GetHandleType()
member GetHandleType : unit -> RebarHandleType
Return Value
RebarHandleType
 The RebarHandleType of the specified RebarConstrainedHandle.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstrainedHandle is no longer valid.
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace